In [387]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pp
import sklearn.linear_model

In [388]:
#loading every data and adding crop name and removing seed if there
#1-banana
data=pd.read_excel("data_folder/banana.xls")
data['Crop']='banana'
data_total=data.copy()
len(data),len(data_total)

(47, 47)

In [389]:
#2-barley
data=pd.read_excel('data_folder/ginger.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='ginger'
data_total=pd.concat([data_total,data],axis=0)
len(data),len(data_total)
#data.head()

(47, 94)

In [390]:
#3-ginger
data=pd.read_excel('data_folder/barley.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='barley'
data_total=pd.concat([data_total,data],axis=0)
len(data),len(data_total)

(47, 141)

In [391]:
#4-papaya
data=pd.read_excel('data_folder/papaya.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='papaya'
data_total=pd.concat([data_total,data],axis=0)
len(data),len(data_total)
#data

#len(data_total)

In [392]:
#5-grape
data=pd.read_excel('data_folder/grape.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='grape'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)

(47, 235)

In [393]:
#6-green pea
data=pd.read_excel('data_folder/green_pea.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='green_pea'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)

(47, 282)

In [394]:
#7-pinnaple
data=pd.read_excel('data_folder/pineapple.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='pineapple'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
data_total.head()

,Date,Area Harvested - Ha,Yield - Hg/Ha,Production Quantity - tonnes,Crop
0,2007-12-31,622200,349829,21766400,banana
1,2006-12-31,600300,347456,20857800,banana
2,2005-12-31,565100,330948,18701900,banana
3,2004-12-31,535000,305203,16328400,banana
4,2003-12-31,498600,277910,13856600,banana

In [395]:
#8-potato
data=pd.read_excel('data_folder/potato.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='potato'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
data_total.head()

In [396]:
#9-tomato
data=pd.read_excel('data_folder/tomato.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='tomato'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
data_total.head()

,Date,Area Harvested - Ha,Yield - Hg/Ha,Production Quantity - tonnes,Crop
0,2007-12-31,622200,349829,21766400,banana
1,2006-12-31,600300,347456,20857800,banana
2,2005-12-31,565100,330948,18701900,banana
3,2004-12-31,535000,305203,16328400,banana
4,2003-12-31,498600,277910,13856600,banana

In [397]:
#10-wheat
data=pd.read_excel('data_folder/wheat.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='wheat'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 470)

In [398]:
#11-tea
data=pd.read_excel('data_folder/tea.xls')
#data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='tea'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 517)

In [399]:
#12-maize
data=pd.read_excel('data_folder/maize.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='maize'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 564)

In [400]:
#13-rice
data=pd.read_excel('data_folder/rice.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='rice'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 611)

In [401]:
#14-sugarcane
data=pd.read_excel('data_folder/sugarcane.xls')
data=data.drop(['Seed - tonnes'],axis=1)
data['Crop']='sugarcane'
len(data)
#data
data_total=pd.concat([data_total,data],axis=0)
data_total
len(data),len(data_total)
#data_total.head()

(47, 658)

In [402]:
#setting proper index , to keep uniqueness
data_total.index=[i for i in range(len(data_total))]

In [403]:
#replacing the Date,which is a timestamp() or datetime() object to year(int64)
data_total['year']=data_total['Date'].dt.year
#deleting Date, column 
data_total.drop('Date',axis=1,inplace=True)
#type(data_total['year'][0])
data_total.head()

,Area Harvested - Ha,Yield - Hg/Ha,Production Quantity - tonnes,Crop,year
0,622200,349829,21766400,banana,2007
1,600300,347456,20857800,banana,2006
2,565100,330948,18701900,banana,2005
3,535000,305203,16328400,banana,2004
4,498600,277910,13856600,banana,2003

In [404]:
#rearranging columns in some other order
cols=data_total.columns.tolist()
cols=cols[-2:]+cols[0:1]+cols[2:3]+cols[1:2]
cols

['Crop',
 'year',
 'Area Harvested - Ha',
 'Production Quantity - tonnes',
 'Yield - Hg/Ha']

In [405]:
#now rearrange the data_total according to these columns
data_total=data_total[cols]
data_total.head()

,Crop,year,Area Harvested - Ha,Production Quantity - tonnes,Yield - Hg/Ha
0,banana,2007,622200,21766400,349829
1,banana,2006,600300,20857800,347456
2,banana,2005,565100,18701900,330948
3,banana,2004,535000,16328400,305203
4,banana,2003,498600,13856600,277910

In [406]:
#exporting to a file
data_total.to_excel('data_complete_arranged.xls')

In [407]:
#shuffling the data so will be easy to devide into train and test data

In [408]:
data_total=data_total.apply(np.random.permutation)
#exporting to filea
data_total.to_excel('data_complete_shuffled.xls')
data_total.head()

,Crop,year,Area Harvested - Ha,Production Quantity - tonnes,Yield - Hg/Ha
0,grape,1993,6000,1200000,18432
1,rice,1978,6300000,73352000,19623
2,barley,1985,70000,104225008,258628
3,tomato,1963,434000,24734608,343061
4,pineapple,1998,12572000,246806,137248